tutorials/icoDyMFoam/movingConeTopo/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 0.001;

vertices        
(
    (-7.5 0.001 -4.36609e-03)
    (-7 0.001 -4.36609e-03)
    (-3.5 0.001 -4.36609e-03)
    (0 0.001 -4.36609e-03)
    (-7.5 0.75 -0.0327457)
    (-7 0.75 -0.0327457)
    (-3.5 2 -0.0873219)
    (0 2 -0.0873219)
    (-7.5 2.5 -0.109152)
    (-7 2.5 -0.109152)
    (-3.5 2.5 -0.109152)
    (0 2.5 -0.109152)
    (-7.5 0.001 4.36609e-03)
    (-7 0.001 4.36609e-03)
    (-3.5 0.001 4.36609e-03)
    (0 0.001 4.36609e-03)
    (-7.5 0.75 0.0327457)
    (-7 0.75 0.0327457)
    (-3.5 2 0.0873219)
    (0 2 0.0873219)
    (-7.5 2.5 0.109152)
    (-7 2.5 0.109152)
    (-3.5 2.5 0.109152)
    (0 2.5 0.109152)
);

blocks          
(
    hex (0 1 5 4 12 13 17 16) (3 3 1) simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18) (4 4 1) simpleGrading (2 0.25 1)
    hex (4 5 9 8 16 17 21 20) (3 3 1) simpleGrading (1 1 1)
    hex (5 6 10 9 17 18 22 21) (10 3 1) simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22) (4 3 1) simpleGrading (2 1 1)
);

edges           
(
);

patches         
(
    wall movingWall 
    (
        (1 5 17 13)
        (5 6 18 17)
        (2 14 18 6)
    )
    patch farFieldMoving 
    (
        (9 21 22 10)
    )
    wall fixedWall 
    (
        (3 7 19 15)
        (7 11 23 19)
    )
    symmetryPlane axis 
    (
        (0 1 13 12)
        (2 3 15 14)
    )
    patch left 
    (
        (0 12 16 4)
        (4 16 20 8)
    )
    patch farField 
    (
        (8 20 21 9)
        (10 22 23 11)
    )
    wedge back 
    (
        (0 4 5 1)
        (2 6 7 3)
        (4 8 9 5)
        (5 9 10 6)
        (6 10 11 7)
    )
    wedge front 
    (
        (12 13 17 16)
        (14 15 19 18)
        (16 17 21 20)
        (17 18 22 21)
        (18 19 23 22)
    )
);


// ************************************************************************* //
