tutorials/icoDyMFoam/movingConeTopo/constant/dynamicMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          dynamicMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMeshLibs   1("libtopoChangerFvMesh.so");

dynamicFvMesh      movingConeTopoFvMesh;

movingConeTopoFvMeshCoeffs
{
    motionVelAmplitude      (0.00051 0 0);
    motionVelPeriod         10;

    leftEdge                -0.0075;
    leftObstacleEdge        -0.007;
    rightObstacleEdge       -0.0035;

    left
    {
        minThickness        2e-4;
        maxThickness        5e-4;
    }

    right
    {
        minThickness        2e-4;
        maxThickness        5e-4;
    }
}

// ************************************************************************* //
