tutorials/icoDyMFoam/movingConeTopo/0/p
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    movingWall      
    {
        type            zeroGradient;
    }

    farFieldMoving
    {
        type            zeroGradient;
    }

    fixedWall
    {
//         type            zeroGradient;
        type            fixedValue;
	    value           uniform 0;
    }

    axis
    {
        type            symmetryPlane;
    }

    left
    {
        type            zeroGradient;
    }

    farField
    {
        type            zeroGradient;
    }

    back
    {
        type wedge;
    }

    front
    {
        type wedge;
    }
}


// ************************************************************************* //
